

INSERT INTO restaurants (name) VALUES
  ('Шашлыкофф'),
  ('Макдоналдс'),
  ('KFC'),
  ('Папа Карло'),
  ('Перчини'),
  ('Чашка Кофе'),
  ('Бургер Кинг');

INSERT INTO users (name, email, password) VALUES
 ('Admin', 'admin@mail.com' , '$2a$10$WejOLxVuXRpOgr4IlzQJ.eT4UcukNqHlAiOVZj1P/nmc8WbpMkiju'),
 ('User_1', 'user1@mail.com', '$2a$10$seI9HiMpF0rR7povEjG.MOi62z9zGIHyY8XsBB6HZTKMxwtbgtH6.'),
 ('User_2', 'user2@mail.com', '$2a$10$A1Nev/cAM3mXyEQe5DOyS.NKZmCba.z6Ko3X6n1lEMRvnXfIJbOse');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_ADMIN', 1),
  ('ROLE_USER', 1),
  ('ROLE_USER', 2),
  ('ROLE_USER', 3);

INSERT INTO dishes (name, price, restaurant_id) VALUES
  ('Шашлык с фирменным соусом', '179-00', 1),
  ('Салат овощной', '119-00', 1),
  ('Морс', '79-00', 1),
  ('Картофель фри', '79-00', 2),
  ('Куриные крылышки', '181-00', 2),
  ('Напиток газированый', '74-00',  2),
  ('Ай Твистер Чиз', '50-00',  3),
  ('3 Стрипса', '103-00', 3),
  ('Пепси 0,5', '70-00', 3),
  ('Паста "Мачерата"', '300-00', 4),
  ('Салат "Беллуно"', '180-00', 4),
  ('Напиток', '50-00', 4),
  ('Салат Лигурия', '99-00', 5),
  ('Суп Сырный', '99-00', 5),
  ('Паста с курицей и грибами', '149-00', 5),
  ('Морс дня', '39-00', 5),
  ('Салат Греческий', '460-00', 6),
  ('Стейк из телятины с булгуром', '860-00', 6),
  ('Кофе Латте', '230-00', 6),
  ('Стейкхаус', '219-00', 7),
  ('Салат Микс', '60-00', 7),
  ('Чай', '10-00', 7);

INSERT INTO dishes (name, price, date, restaurant_id) VALUES
  ('Тестовая еда 1', '100-00', '2017-01-11', 1),
  ('Тестовая еда 2', '150-00', '2017-01-11', 1),
  ('Тестовая еда 3', '50-00', '2017-01-11', 2),
  ('Тестовая еда 4', '70-00', '2017-01-11', 2),
  ('Тестовая еда 5', '120-00', '2017-01-11', 3),
  ('Тестовая еда 6', '30-00', '2017-01-11', 3);

INSERT INTO votes (amount, date, restaurant_id) VALUES
  (3, '2017-01-11', 1),
  (4, '2017-01-11', 2),
  (5, '2017-01-11', 3);

-- INSERT INTO votes (amount, restaurant_id) VALUES
--   (3, 2);
